Tekla Open API Reference for Tekla Structures 2025
ContainerElement Properties
The ContainerElement type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements contained in the ICollection.
Frame
 The frame of the container element.
IsSynchronized
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
SyncRoot
 Gets an object that can be used to synchronize access to the ICollection.
Top
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace